{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {
        "tag": "service",
        "patterns": [
          "What services you provide",
          "Services provided by you",
          "Your services",
          "services",
          "service"
        ],
        "responses": [
          "Our services include Mobile app development, Web app development, Machine learning, Aritificial Intelligence, Internet of Things, DevOps Engineering, QA Automation and Blockchain",
          "We offer services such as Mobile app development, Web app development, Machine learning, Aritificial Intelligence, Internet of Things, DevOps Engineering, QA Automation and Blockchain "
        ]
      },
      {
        "tag": "frontend technology",
        "patterns": [
          "frontend technologies",
          "What frontend technologies you use",
          "frontend technology",
          "frontend"
        ],
        "responses": [
          "Our frontend technologies include HTML, CSS, Java Script, React, Angular, JQuery, Swift, Vue.js, Preact, Backbone.js and Ember.js"
        ]
      },
      {
        "tag": "backend technology",
        "patterns": [
          "backend technologies",
          "What backend technologies you use",
          "backend technology",
          "backend"
        ],
        "responses": [
          "Our backend technologies include Django, Ruby on Rails, ExpressJs, Springboot, Flask, ASP.Net, Node.js, JavaScript, Python, PHP, Java, Ruby, Golang and C#"
        ]
      },
      {
        "tag": "technology",
        "patterns": [
          "technologies",
          "What technologies you use",
          "your technologies",
          "your expertise",
          "technology"
        ],
        "responses": [
          "Our technologies encompass a broad spectrum, ranging from backend solutions like Django, Ruby on Rails, ExpressJS, Spring Boot, Flask, ASP.NET, Node.js, Python, PHP, Java, Ruby, Golang, and C# to frontend technologies such as HTML, CSS, JavaScript, React, Angular, jQuery, Swift, Vue.js, Preact, Backbone.js, and Ember.js"
        ]
      },
      {
        "tag": "intro",
        "patterns": [
          "Short introduction about your company",
          "Short intro about your company",
          "What is your company about",
          "Detail about your company",
          "Your company",
          "Intro about your company",
          "About your company"
          
        ],
        "responses": [
          "meteoriQs is a recognisable Chennai based company specialized in Product Development, Technology Services and Consulting Services",
          "We are a recognisable Chennai based company specialized in Product Development, Technology Services and Consulting Services and are deeply committed in offering agility, quality, and efficiency in every service we render to our clients and international business partners. "
        ]
      },
      {
        "tag": "industries",
        "patterns": [
          "Which industries do you work for",
          "Any specific industries you provide services",
          "Which sectors you provide services into",
          "industries",
          "sectors"
        ],
        "responses": [
          "Our services are provided across sectors like BFSI, Food&Beverages, Manufacturing, Education, E-commerce, Construction, Medical Services, Real Estate, etc",
          "We provide our services for various sectors like BFSI, Food&Beverages, Manufacturing, Education, E-commerce, Construction, Medical Services, Real Estate, etc"
        ]
      },
      {
        "tag": "mobile app development",
        "patterns": [
          "Intro about your mobile app development service",
          "Mobile app development service",
          "Mobile app development",
          "mobile app"

        ],
        "responses": [
        "We stand out as our primary focus is developing apps that are hybrid, native and superior cross-platform compatible mobile apps. With an experienced team in mobile app development, we assure you sophisticated, logical and remarkable mobile apps."
        ]
      },
      {
        "tag": "web app development",
        "patterns": [
          "Intro about your web app development service",
          "web app development service",
          "web app development",
          "web app"
        ],
        "responses": [
        "Using our web application services we can make our clients long awaited desires come into reality by assisting them in creating online applications that they have been idealizing. We can take care of everything from planning to designing till hosting and maintenance of the application."
        ]
      },
      {
        "tag": "artificial intelligence",
        "patterns": [
          "Intro about your artificial intelligence service",
          "artificial intelligence service",
          "artificial intelligence",
          "ai"
        ],
        "responses": [
        "The utmost essential factor i.e. repeatability is provided in all our AI products. We offer instant AI solutions that leads in acquiring authentic and precise results. It is our main priority to protect data so we never compromise on security."
        ]
      },
      {
        "tag": "machine learning",
        "patterns": [
          "Intro about your machine learning service",
          "machine learning service",
          "machine learning",
          "ml"
        ],
        "responses": [
        "The algorithms are customised and created by our qualified team to meet the needs of our clients. Under no circumstances we economize on data compliance and security."
        ]
      },
      {
        "tag": "iot",
        "patterns": [
          "Intro about your iot service",
          "internet of things service",
          "iot"
        ],
        "responses": [
        "The algorithms are customised and created by our qualified team to meet the needs of our clients. Under no circumstances we economize on data compliance and security."
        ]
      },
      {
        "tag": "devops",
        "patterns": [
          "Intro about your devops service",
          "devops engineering service",
          "devops"
        ],
        "responses": [
        "We handle the entire process starting from testing to monitoring all the operations. Our aim is to deliver software's that are faster, definitive and with better quality. Our skilled DevOps practice automates all SDLC processes."
        ]
      },
      {
        "tag": "qa",
        "patterns": [
          "Intro about your qa automation service",
          "qa automation service",
          "qa automation",
          "automation"
        ],
        "responses": [
        "Our QA Automations services are adhered to various clients from enormous industries. These services provided by meteoriQs helps our clients as it increases accuracy, improves productivity, saves time and reduces human error."
        ]
      },
      {
        "tag": "tools",
        "patterns": [
          "Which qa automation tools you use",
          "qa automation tools",
          "automation tools",
          "Which qa automation tools you are expertised in",
          "Which automation tools you are expertised in",
          "Which automation tools you use"
        ],
        "responses": [
        "We possess expertise in various automation tools, including Cypress, WebdriverIO, Playwright, REST API automation, QA manual, Protractor, UFT, TestComplete, Tosca, TestNG, SoapUI, Apache JMeter, Sikuli, Cucumber, Watir, Selenium, and Appium."
        ]
      },
      {
        "tag": "tools",
        "patterns": [
          "Which devops tools you use",
          "devops tools",
          "Which devops tools you are expertised in",
          "Which devops tools you use"
        ],
        "responses": [
        "We possess expertise in various devops tools, including Slack, Jenkins, Docker, Phantom, Nagios, Vagrant, Ansible GitHub, Sentry, Bitbucket, Mesos, Dynatrace, AppDynamics, Instana, Catchpoint, Splunk, Sensu, Chef, Puppet, Grafana, Liquibase, Datadog, New Relic, Ansible, Helm."
        ]
      },
      {
        "tag": "java",
        "patterns": [
          "java",
          "more about java",
          "Your expertise in java",
          "Java expertise",
          "Expertise on java"
        ],
        "responses": [
        "Java is a fundamental part of our backend development, known for its platform independence and reliability. Our team leverages Java's strong object-oriented principles to build scalable and enterprise-grade applications using frameworks such as Core Java, EJB, SpringBoot, Hibernate, JPA, REST Webservices, JMS, Reactive Programming, SOAP Services."
        ]
      },
      {
        "tag": "php",
        "patterns": [
          "PHP",
          "more about PHP",
          "Your expertise in PHP",
          "PHP expertise",
          "Expertise on PHP"
        ],
        "responses": [
        "PHP powers our backend solutions, providing a versatile and widely-used scripting language. Our team utilizes PHP for developing dynamic and data-driven web applications. Its seamless integration with databases and web servers makes PHP a reliable choice for our backend development."
        ]
      },
      {
        "tag": "django",
        "patterns": [
          "django",
          "more about django",
          "Your expertise in django",
          "django expertise",
          "Expertise on django"
        ],
        "responses": [
        "Django serves as the backbone of our backend development, providing a high-level, Pythonic framework for building robust web applications. Our expertise in Django enables us to create scalable and feature-rich server-side solutions. Its emphasis on simplicity and reusability aligns with our commitment to efficient development."
        ]
      },
      {
        "tag": "flask",
        "patterns": [
          "flask",
          "more about flask",
          "Your expertise in flask",
          "flask expertise",
          "Expertise on flask"
        ],
        "responses": [
        "Flask is our preferred framework for lightweight and flexible Python-based backend development. Our team utilizes Flask for its simplicity and modularity, making it an excellent choice for developing RESTful APIs and web services. Flask's lightweight nature aligns with our focus on resource-efficient solutions."
        ]
      },
      {
        "tag": "ruby on rails",
        "patterns": [
          "ruby on rails",
          "more about ruby on rails",
          "Your expertise in ruby on rails",
          "ruby on rails expertise",
          "Expertise on ruby on rails"
        ],
        "responses": [
        "Ruby on Rails empowers our backend solutions with an elegant and developer-friendly framework. Our team capitalizes on Rails' conventions and modular structure to accelerate development, delivering scalable and efficient web applications. Ruby on Rails remains a key player in our backend toolkit."
        ]
      },
      {
        "tag": "springboot",
        "patterns": [
          "ruby on springboot",
          "more about springboot",
          "Your expertise in springboot",
          "springboot expertise",
          "Expertise on springboot"
        ],
        "responses": [
        "For Java-based backend development, we turn to Spring Boot, a powerful and convention-over-configuration framework. Our team capitalizes on Spring Boot's features to build scalable and enterprise-grade applications with ease. Its robust architecture aligns with our commitment to delivering high-quality solutions."
        ]
      },
      {
        "tag": "backbone",
        "patterns": [
          "ruby on backbone",
          "more about backbone",
          "Your expertise in backbone",
          "backbone expertise",
          "Expertise on backbone"
        ],
        "responses": [
        "Backbone.js provides structure to our client-side applications, offering models, views, and collections for enhanced organization. With Backbone.js, our team streamlines the development of single-page applications, ensuring a clear and modular architecture for maintainable projects"
        ]
      },
      {
        "tag": "python",
        "patterns": [
          "python",
          "more about python",
          "Your expertise in python",
          "Python expertise",
          "Expertise on python"
        ],
        "responses": [
        "With a wealth of experience, our team excels in Python development. We leverage the power of Python for its readability, versatility, and extensive ecosystem. Our expertise extends to frameworks such as Django, Flask, and FastAPI, enabling us to deliver scalable and efficient solutions tailored to your project's needs."
        ]
      },
      {
        "tag": ".net",
        "patterns": [
          ".net",
          "dot net",
          "more about dot net",
          "Your expertise in .net",
          ".net expertise",
          "Expertise on dot net"
        ],
        "responses": [
        "Bringing our expertise to the table, our .NET development team is well-versed in crafting robust and scalable applications. We specialize in the use of the .NET framework, including ASP.NET for web development and Xamarin for cross-platform mobile development. Our proficiency extends to technologies like Entity Framework for efficient data handling and MVC for building modular and maintainable applications."
        ]
      },
      {
        "tag": "node.js",
        "patterns": [
          "node.js",
          "node",
          "more about node",
          "Your expertise in node",
          "node expertise",
          "Expertise on node"
        ],
        "responses": [
        "With around many years of hands-on experience, our Node.js development team is adept at building high-performance, scalable applications. We harness the event-driven, non-blocking nature of Node.js for real-time applications and microservices. Our expertise covers popular frameworks such as Express.js and Nest.js, allowing us to create efficient and modern server-side solutions."
        ]
      },
      {
        "tag": "react",
        "patterns": [
          "react",
          "more about react",
          "Your expertise in react",
          "react expertise",
          "Expertise on react"
        ],
        "responses": [
        "Our team boasts experience in React development, delivering dynamic and interactive user interfaces for web applications. We appreciate the component-based architecture of React, and our proficiency extends to state management with Redux and context API. Whether it's building single-page applications or integrating React into existing projects, we ensure a seamless and engaging user experience."
        ]
      },
      {
        "tag": "angular",
        "patterns": [
          "angular",
          "more about angular",
          "Your expertise in angular",
          "angular expertise",
          "Expertise on angular"
        ],
        "responses": [
        "Our Angular development team excels in creating dynamic and feature-rich web applications. We leverage the power of Angular's modular architecture and two-way data binding to build scalable solutions. Our expertise extends to using Angular Material for designing consistent and responsive user interfaces, ensuring a modern and polished user experience."
        ]
      },
      {
        "tag": "chatbot",
        "patterns": [
          "chatbot",
          "more about chatbot",
          "Your expertise in developing chatbot", 
          "chatbot expertise",
          "Expertise on chatbot"
        ],
        "responses": [
        "At meteoriQs, we specialize in creating customized chatbot solutions tailored to your unique needs. Powered by cutting-edge AI and natural language processing technologies, our chatbots provide efficient, round-the-clock support, improve user experiences, and boost productivity."        
        ]
      },
      {
        "tag": "software development",
        "patterns": [
          "software development",
          "custom software development",
          "more about software development services",
          "Your expertise in developing custom softwares", 
          "software development expertise",
          "Expertise on software development"
        ],
        "responses": [
        "We specialize in custom software development, tailoring solutions to meet the unique requirements of each client for optimal performance and user experience."        
        ]
      },
      {
        "tag": "ui/ux",
        "patterns": [
          "ui/ux design",
          "more about ui/ux designing services",
          "Your expertise in ui/ux designing", 
          "ui/ux designing expertise",
          "Expertise on ui/ux designing"
        ],
        "responses": [
        "Our skilled design team focuses on creating intuitive and visually appealing user interfaces, ensuring a seamless and engaging experience for your application or website."        
        ]
      },
      {
        "tag": "cloud services",
        "patterns": [
          "cloud services",
          "more about cloud services",
          "Your expertise in cloud services", 
          "cloud services expertise",
          "Expertise on cloud services"
        ],
        "responses": [
        "We provide cloud services on leveraging platforms such as AWS, Azure, and Google Cloud to ensure scalability, reliability, and cost-effectiveness for your applications."        
        ]
      },
      {
        "tag": "blockchain",
        "patterns": [
          "Intro about your blockchain service",
          "blockchain service",
          "blockchain"
        ],
        "responses": [
        "Blockchain services provided by our company helps clients receive quick and accurate information as information is crucial for businesses, it is an important tool as it provides a secure and transparent way to store and transfer data."
        ]
      }
    ]
  }
  
  
